{
  "blogs": [
    {
      "title": "Grybby-looking pub",
      "body": "It was a tiny, grubby-looking pub. If Hagrid had not pointed it out, Harry wouldn not have noticed it was there. The people hurrying by didn not glance at it. Their eyes slid from the big book shop on one side to the record shop on the other as if they could not see the Leaky Cauldron at all. In fact, Harry had the most peculiar feeling that only he and Hagrid could see it. Before he could mention this, Hagrid had steered him inside. For a famous place, it was very dark and shabby. A few old women were sitting in a corner, drinking tiny glasses of sherry. One of them was smoking a long pipe. A little man in a top hat was talking to the old bartender, who was quite bald and looked like a toothless walnut. The low buzz of chatter stopped when they walked in",
      "author": "Harry Potter",
      "id": 1
    },
    {
      "title": "Room of Requirement's",
      "body": "They finished their breakfast in silence. Hermione set off immediately for Ancient Runes; Ron for the common room, where he still had to finish his conclusion on Snape's Dementor essay, and Harry for the corridor on the seventh floor and the stretch of wall opposite the tapestry of Barnabas the Barmy teaching trolls to do ballet. Harry slipped on his Invisibility Cloak once he had found an empty passage, but he need not have bothered. When he reached his destination he found it deserted. Harry was not sure whether his chances of getting inside the room were better with Malfoy inside it or out, but at least his first attempt was not going to be complicated by the presence of Crabbe or Goyle pretending to be an eleven-year-old girl. He closed his eyes as he approached the place where the Room of Requirement's door was concealed. He knew what he had to do; he had become most accomplished at it last year. Concentrating with all his might he thought, I need to see what Malfoy's doing in here... I need to see what Malfoy's doing in here... I need to see what Malfoy's doing in here...",
      "author": "Hermione Granger",
      "id": 2
    },
    {
      "title": "The eaves of the Forest",
      "body": "Just as they felt their feet slowing down to a standstill, they noticed that the ground was gently rising. The water began to murmur. In the darkness they caught the white glimmer of foam, where the river flowed over a short fall. Then suddenly the trees came to an end and the mists were left behind. They stepped out from the Forest, and found a wide sweep of grass welling up before them. The river, now small and swift, was leaping merrily down to meet them, glinting here and there in the light of the stars, which were already shining in the sky. The grass under their feet was smooth and short, as if it had been mown or shaven. The eaves of the Forest behind were clipped, and trim as a hedge. The path was now plain before them, well-tended and bordered with stone. It wound up on to the top of a grassy knoll, now grey under the pale starry night; and there, still high above them on a further slope, they saw the twinkling lights of a house. Down again the path went, and then up again, up a long smooth hillside of turf, towards the light. Suddenly a wide yellow beam flowed out brightly from a door that was opened. There was Tom Bombadil’s house before them, up, down, under hill. Behind it a steep shoulder of the land lay grey and bare, and beyond that the dark shapes of the Barrow-downs stalked away into the eastern night.",
      "author": "Samwise Gamgee",
      "id": 3
    }
  ]
}